Cricket Analysis

This analysis is a replication of the research done by " ". However, the dataset is different than the replicated research paper. Also, it looks at the batting rankings only. All of the data were obtained from ESPN Cricinfo.com.

Firstly, the required libraries were imported.

In [1]:
#Import required libraries
import pandas as pd 
import requests
import numpy as np
from pandas.tools.plotting import table

Importing the overall batting statistics for the 2013 T20 world cup. After importing the dataset , I have dropped the columns that I do not need for this analysis.

In [2]:
#import the data set


url = 'http://stats.espncricinfo.com/world-t20/engine/records/averages/batting.html?id=8083;type=tournament'
html = requests.get(url).content
df_list = pd.read_html(html)
df = df_list[0]
df.drop(df.columns[[9,10,11,12,13]],axis=1, inplace=True)

In [9]:

type(df)

pandas.core.frame.DataFrame

Since, all of the variables in the columns were of object type, I had to convert them to integer or float type to be able to make necessary calculation. However, I was unable to make the conversion in the High Score (HS) column, because of the * characters which represented the Not Out scores of batsmen. I stripped the character off from the data and only had numbers.

In [28]:
#strip of the * character from the HS colname
# @hidden_cell
df['HS'] = df['HS'].map(lambda x:x.rstrip('*'))

Once the dataset was stripped off the * character, I was able to make the transistion to integer. However, there were some '-' characters, I was able to add an exception using errors='coerce' so that the columns could be converted to interger.

In [29]:
#Convert the values to int or float and replace missing values with Nan
df['Ave']=df.Ave.apply(pd.to_numeric, errors='coerce')
df['Inns']=df.Inns.apply(pd.to_numeric, errors='coerce')
df['NO']=df.NO.apply(pd.to_numeric, errors='coerce')
df['Runs']=df.Runs.apply(pd.to_numeric, errors='coerce')
df['HS']=df.HS.apply(pd.to_numeric, errors='coerce')
df['BF']=df.BF.apply(pd.to_numeric, errors='coerce')
df['SR']=df.SR.apply(pd.to_numeric, errors='coerce')

Once the conversion was done, I dropped off the players data who had batted less than 2 innings.

In [30]:
#drop the players with lesser than 1 innings. (Efficient ways of doing this)
df = df[np.isfinite(df['Inns'])]
df = df[df.Inns > 2]

Finally, I sorted the dataset and ranked the players according to their rankings.

In [31]:
#Sort based on Average (Efficient ways of doing this)
avg_based = df.sort_values(by='Ave', ascending=False)
#reset and start indexing from 1
avg_based = avg_based.reset_index(drop=True)
avg_based.index += 1

However, this study required me to calculate the rankings based on other factors. Referring to the earlier document, I need to calculate the e2 and e6 values.

Where, e2 = (sumout + 2×sumno)/n and e6 = (sumout + f6×sumno)/n where f6 = 2.2 – 0.01×avno. 

This calculation could only be done if I had the sum of out scores, and sum of not out scores. And my earlier dataset did not contain any of this information.

I therefore needed to get the individual scores each batsman scored during the tournament. And I needed the sum of total not out scores and sum of out scores. Again, I downloaded the dataset for the each batsman individual scores. I could have done it more efficiently, however, I repeated the process of getting the dataset from over ten tables. I made sure that the dataset contained scores of batsmen that had batted more than two innings as that was the requirement according to the earlier table. 

I dropped of unwanted columns from the datasets.

In [10]:
def fetch_data_from_url(url):
    html = requests.get(url).content
    df_list = pd.read_html(html)
    df = df_list[2]
    df.index += 1 
    df.drop(df.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)
    return df

url_1= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
df_1 = fetch_data_from_url(url_1)
df_1.head(10)

                   Player  Runs
1          AD Hales (ENG)  116*
2     Ahmed Shehzad (PAK)  111*
3        Umar Akmal (PAK)    94
4   DPMD Jayawardene (SL)    89
5          JP Duminy (SA)   86*
6         V Kohli (INDIA)    77
7        GJ Maxwell (AUS)    74
8         TLW Cooper (NL)   72*
9         V Kohli (INDIA)   72*
10          DR Smith (WI)    72

In [32]:



url_1= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_1 = requests.get(url_1).content
df_list_1 = pd.read_html(html_1)
df_1 = df_list_1[2]
df_1.index += 1 
df_1.drop(df_1.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_2= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=2;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_2 = requests.get(url_2).content
df_list_2 = pd.read_html(html_2)
df_2 = df_list_2[2]
df_2.index += 1 
df_2.drop(df_2.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_3= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=3;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_3 = requests.get(url_3).content
df_list_3 = pd.read_html(html_3)
df_3 = df_list_3[2]
df_3.index += 1 
df_3.drop(df_3.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_4= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=4;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_4 = requests.get(url_4).content
df_list_4 = pd.read_html(html_4)
df_4 = df_list_4[2]
df_4.index += 1
df_4.drop(df_4.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_5= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=5;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_5 = requests.get(url_5).content
df_list_5 = pd.read_html(html_5)
df_5 = df_list_5[2]
df_5.index += 1 
df_5.drop(df_5.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_6= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=6;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_6 = requests.get(url_6).content
df_list_6 = pd.read_html(html_6)
df_6 = df_list_6[2]
df_6.index += 1 
df_6.drop(df_6.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_7= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=7;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_7 = requests.get(url_7).content
df_list_7 = pd.read_html(html_7)
df_7 = df_list_7[2]
df_7.index += 1
df_7.drop(df_7.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_8= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=8;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_8 = requests.get(url_8).content
df_list_8 = pd.read_html(html_8)
df_8 = df_list_8[2]
df_8.index += 1 
df_8.drop(df_8.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

url_9= "http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=9;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_9 = requests.get(url_9).content
df_list_9 = pd.read_html(html_9)
df_9 = df_list_9[2]
df_9.index += 1 
df_9.drop(df_9.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)


url_10="http://stats.espncricinfo.com/ci/engine/stats/index.html?class=3;filter=advanced;host=25;orderby=batting_average;page=10;season=2013%2F14;template=results;trophy=89;type=batting;view=innings"
html_10 = requests.get(url_10).content
df_list_10 = pd.read_html(html_10)
df_10 = df_list_10[2]
df_10.index += 1 
df_10.drop(df_10.columns[[2,3,4,5,6,7,8,9,10,11,12]],axis=1, inplace=True)

Finally, I merged all of the tables into one dataframe. This merger took place based on the rows. I needed player with the same names to be merged in the same column. For this I grouped the merged dataframe by Player name and joined the as a column. This gave me the dataframe that had Players name in one column, but all of the scores were in the second column separated by commas. I then separated the scores separated by commas into other columns and renamed them to 

Player| Inns_1||Inns_2|....|Inns_7|

In [33]:
#merge all the dataframe together in a row
frames = [df_1, df_2, df_3, df_4,df_5,df_6,df_7,df_8,df_9,df_10,]
result = pd.concat(frames)
#group by player 
result= result.groupby(['Player'])['Runs'].apply(', '.join).reset_index()
result=pd.concat([result[['Player']], result['Runs'].str.split(', ', expand=True)], axis=1)
result.columns= ['Player','Inns_1','Inns_2','Inns_3','Inns_4','Inns_5','Inns_6','Inns_7']

I then dropped of any player that might have not played more than two innings.

In [34]:
#Drop rows with cols that have more more than two None
more_than_two_inns=result.dropna(subset=['Inns_1','Inns_2','Inns_3','Inns_4','Inns_5','Inns_6','Inns_7'], thresh=3)

I also replaced all the NAN values to blank. The Inns column could have (*) character meaning not-out scores, however, I was not able to convert them to integer because of the * sign. But replacing the NAN values also replaced all the * sign scores to blank. I now could calculate the out scores.

In [35]:
#replace the nan values with blank space
more_than_two_inns = more_than_two_inns.replace(np.nan, '', regex=True)

In [66]:
out_scores= more_than_two_inns[:]

In [67]:
more_than_two_inns.head(2)

                Player Inns_1 Inns_2 Inns_3 Inns_4 Inns_5 Inns_6 Inns_7
0  AB de Villiers (SA)    69*     24     21     10      5
1       AD Hales (ENG)   116*     38     12

I copied my dataframe to a new dataframe for calculating the sum of out scores
Finally, I changed all the Inns column to integer, and I was able to add the out scores of the individual batsmen. The Inns column could have (*) character meaning not-out scores, however, using errors='coerce' I was able to make an exception to these cases. And all the not-out scores were replaced to NAN. Now, I could easily calculate the sum of Out scores.

In [69]:
#Remove the Not-out scores (it has *)- I do that by converting the cols into integer whilst 
#ignoring the not-out scores
out_scores['Inns_1']=out_scores.Inns_1.apply(pd.to_numeric, errors='coerce')
out_scores['Inns_2']=out_scores.Inns_2.apply(pd.to_numeric, errors='coerce')
out_scores['Inns_3']=out_scores.Inns_3.apply(pd.to_numeric, errors='coerce')
out_scores['Inns_4']=out_scores.Inns_4.apply(pd.to_numeric, errors='coerce')
out_scores['Inns_5']=out_scores.Inns_5.apply(pd.to_numeric, errors='coerce')
out_scores['Inns_6']=out_scores.Inns_6.apply(pd.to_numeric, errors='coerce')
out_scores['Inns_7']=out_scores.Inns_7.apply(pd.to_numeric, errors='coerce')

In [71]:
#Add all the out_scores
out_scores['Total'] = out_scores.sum(axis=1)

In [72]:
out_scores.head(5)

,Player,Inns_1,Inns_2,Inns_3,Inns_4,Inns_5,Inns_6,Inns_7,Total
0,AB de Villiers (SA),NaN,24.0,21.0,10.0,5.0,NaN,NaN,60.0
1,AD Hales (ENG),NaN,38.0,12.0,NaN,NaN,NaN,NaN,50.0
2,AD Mathews (SL),43.0,40.0,NaN,6.0,NaN,NaN,NaN,89.0
3,AD Poynter (IRE),57.0,23.0,4.0,NaN,NaN,NaN,NaN,84.0
5,AJ Finch (AUS),71.0,65.0,16.0,6.0,NaN,NaN,NaN,158.0

In [73]:
all_scores=more_than_two_inns[:]

Again, I made a new dataframe to calculate the total runs scored by each batsman. I relaced the NAN values to blank and then stripped the Not out symbol * from the scores. I could then convert the columns to integer,and then added the total scores.

In [74]:
all_scores = all_scores.replace(np.nan, '', regex=True)

In [4]:
all_scores.head(10)

NameError: name 'all_scores' is not defined

In [75]:
all_scores['Inns_1'] = all_scores['Inns_1'].map(lambda x:x.rstrip('*'))
all_scores['Inns_2'] = all_scores['Inns_2'].map(lambda x:x.rstrip('*'))
all_scores['Inns_3'] = all_scores['Inns_3'].map(lambda x:x.rstrip('*'))
all_scores['Inns_4'] = all_scores['Inns_4'].map(lambda x:x.rstrip('*'))
all_scores['Inns_5'] = all_scores['Inns_5'].map(lambda x:x.rstrip('*'))
all_scores['Inns_6'] = all_scores['Inns_6'].map(lambda x:x.rstrip('*'))
all_scores['Inns_7'] = all_scores['Inns_7'].map(lambda x:x.rstrip('*'))

In [76]:
all_scores['Inns_1']= pd.to_numeric(all_scores.Inns_1).astype(float)
all_scores['Inns_2']= pd.to_numeric(all_scores.Inns_2).astype(float)
all_scores['Inns_3']= pd.to_numeric(all_scores.Inns_3).astype(float)
all_scores['Inns_4']= pd.to_numeric(all_scores.Inns_4).astype(float)
all_scores['Inns_5']= pd.to_numeric(all_scores.Inns_5).astype(float)
all_scores['Inns_6']= pd.to_numeric(all_scores.Inns_6).astype(float)
all_scores['Inns_7']= pd.to_numeric(all_scores.Inns_7).astype(float)

In [77]:
all_scores['Total_runs']= all_scores.iloc[:, 1:-1].sum(axis=1)

In [78]:
all_scores.head(2)

,Player,Inns_1,Inns_2,Inns_3,Inns_4,Inns_5,Inns_6,Inns_7,Total_runs
0,AB de Villiers (SA),69.0,24.0,21.0,10.0,5.0,NaN,NaN,129.0
1,AD Hales (ENG),116.0,38.0,12.0,NaN,NaN,NaN,NaN,166.0

In [79]:
all_scores= all_scores.replace(np.nan, '', regex=True)

In [80]:
all_scores.head(2)

,Player,Inns_1,Inns_2,Inns_3,Inns_4,Inns_5,Inns_6,Inns_7,Total_runs
0,AB de Villiers (SA),69.0,24.0,21.0,10,5,,,129.0
1,AD Hales (ENG),116.0,38.0,12.0,,,,,166.0

In [81]:
result_1 = pd.concat([out_scores, all_scores], axis=1, sort=False)

In [82]:
result_1.columns= ['Player',"","","","","","","",'Sumout','Player_1',"1","2","3","4","5","6","7","Total Runs"]

In [83]:
result_1=result_1.drop(result_1.columns[[1,2,3,4,5,6,7,9]],axis=1)

In [84]:
result_1= result_1[['Player', '1', '2', '3','4','5','6','7','Sumout','Total Runs']]

In [85]:
result_1.head(2)

                Player      1     2     3   4  5 6 7  Sumout  Total Runs
0  AB de Villiers (SA)   69.0  24.0  21.0  10  5        60.0       129.0
1       AD Hales (ENG)  116.0  38.0  12.0               50.0       166.0

Now to find the sum of Not out runs, I substracted the sum of out runs from the total runs. This gave me the column for sum for Not out runs.

In [86]:
#Finding the total Not-Out Runs by substracting out runs from Total runs
result_1['Sumno']= result_1['Total Runs']-result_1['Sumout']

I then merged this individual innings dataframe with my first dataframe according to players name. I was roughly able to check to see if all the batsmen had similar amount of runs from the first table and the second innings by innigs table.

In [87]:
result_1.head(5)

,Player,1,2,3,4,5,6,7,Sumout,Total Runs,Sumno
0,AB de Villiers (SA),69.0,24.0,21.0,10,5,,,60.0,129.0,69.0
1,AD Hales (ENG),116.0,38.0,12.0,,,,,50.0,166.0,116.0
2,AD Mathews (SL),43.0,40.0,11.0,6,,,,89.0,100.0,11.0
3,AD Poynter (IRE),57.0,23.0,4.0,,,,,84.0,84.0,0.0
5,AJ Finch (AUS),71.0,65.0,16.0,6,,,,158.0,158.0,0.0

In [103]:
#sort the initial dataframe alphabhetically
df_main=df.sort_values('Player', ascending=True)

In [104]:
df_3 = pd.merge(df_main, result_1, on='Player', how='right')

In [105]:
df_3.head(2)

,Player,Mat,Inns,NO,Runs,HS,Ave,BF,SR,1,2,3,4,5,6,7,Sumout,Total Runs,Sumno
0,AB de Villiers (SA),5,5.0,1.0,129.0,69.0,32.25,79.0,163.29,69.0,24.0,21.0,10,5,,,60.0,129.0,69.0
1,AD Hales (ENG),4,4.0,1.0,166.0,116.0,55.33,105.0,158.09,116.0,38.0,12.0,,,,,50.0,166.0,116.0

In [106]:
df_3.drop(df_3.columns[[1,4,5,7]],axis=1, inplace=True)

In [107]:
df_3.head(2)

,Player,Inns,NO,Ave,SR,1,2,3,4,5,6,7,Sumout,Total Runs,Sumno
0,AB de Villiers (SA),5.0,1.0,32.25,163.29,69.0,24.0,21.0,10,5,,,60.0,129.0,69.0
1,AD Hales (ENG),4.0,1.0,55.33,158.09,116.0,38.0,12.0,,,,,50.0,166.0,116.0

In [108]:
#calculate e2
df_3['e2']= (df_3.Sumout + 2*(df_3.Sumno))/df_3.Inns

In [109]:
#calculate f6
avno= (df_3.Sumno/df_3.NO)

In [110]:
avno = avno.replace(np.nan, '0', regex=True)

In [111]:
avno=avno.apply(pd.to_numeric, errors='coerce')

In [112]:
f6=2.2-0.01*avno

In [113]:
#calculate e6 = (sumout + f6×sumno)/n where f6 = 2.2 – 0.01×avno. 
df_3['e6']=(df_3.Sumout+f6*df_3.Sumno)/df_3.Inns

In [114]:
#calculate e26
df_3['e26']=(df_3.e2+df_3.e6)/2

In [115]:
#SR average

ASR=df.SR.sum(axis=0)/209

In [116]:
df_3.head(2)

,Player,Inns,NO,Ave,SR,1,2,3,4,5,6,7,Sumout,Total Runs,Sumno,e2,e6,e26
0,AB de Villiers (SA),5.0,1.0,32.25,163.29,69.0,24.0,21.0,10,5,,,60.0,129.0,69.0,39.6,32.838,36.219
1,AD Hales (ENG),4.0,1.0,55.33,158.09,116.0,38.0,12.0,,,,,50.0,166.0,116.0,70.5,42.660,56.580

In [117]:
#calculate BP wher BP26 = e26 ×RP = e26×(SR/124.0)0.5 

df_3['BP26'] = df_3.e26*(df_3.SR/ASR)**0.5

In [146]:
main_table=df_3[:]

In [147]:
main_table.head(2)

,Player,Inns,NO,Ave,SR,1,2,3,4,5,6,7,Sumout,Total Runs,Sumno,e2,e6,e26,BP26
0,AB de Villiers (SA),5.0,1.0,32.25,163.29,69.0,24.0,21.0,10,5,,,60.0,129.0,69.0,39.6,32.838,36.219,59.195479
1,AD Hales (ENG),4.0,1.0,55.33,158.09,116.0,38.0,12.0,,,,,50.0,166.0,116.0,70.5,42.660,56.580,90.988695

In [148]:
#Sort based on BP26(Efficient ways of doing this)
main_table.drop(main_table.columns[[4,5,6,7,8,9,10,11]],axis=1, inplace=True)
main_table = main_table.sort_values(by='BP26', ascending=False)
#reset and start indexing from 1
main_table = main_table.reset_index(drop=True)

main_table.index += 1

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/pandas/core/frame.py:3694: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

In [149]:
main_table.to_csv('batting_table.csv')
df.to_csv('batting1.csv')
result_1.to_csv('batting_sum.csv')
result.to_csv('batting_with_not_out_symbol')

In [150]:
final_table= main_table.head(50)

In [151]:

final_table.to_csv('final_table.csv')